package days03;

/**
 * @author LEE
 * @date 2024. 1. 3. - 오후 3:28:27
 * @subject
 * @content
 */
public class Ex05 {

	public static void main(String[] args) {

		/*
		 * 단항,삼항,대입 연산자만 우측에서 왼쪽으로 연산
		 * [연산자 우선 순위]
		 * 1) 단항연산자			<=
		 * 	~ ! (cast) ++ --
		 * 2) 산술 연산자
		 * 	 *  / %
		 * 	 + -
		 * 	[비트] 쉬프트 연산자 >> <<
		 * 3) 비교연산자
		 * 	  > < >= <=		instanceof
		 * 		== !=
		 * 4) 논리연산자
		 * 	&
		 * 	^
		 * 	|
		 * 	&&
		 * 	||
		 * 5) 삼항(조건)연산자 			<=
		 * 	  항1 ? 항2 : 항3
		 * 6)대입 연산자 a=b=c=10  <=
		 * 	=
		 * 	복합 대입연산자
		 * 	+= -= /= %= &= |= ^= >>= <<= *=
		 * 	n/=2	n = n / 2
		 *  n%=2	n = n % 2
		 * 
		 */
		
		

	}

}
