package days02;


/**
 * @author LEE
 * @date 2024. 1. 2. - 오후 4:24:06
 * @subject
 * @content
 */
public class Ex10 {

	public static void main(String[] args) {
		
		//정수 10 => 0000 1010
		//음수 -10=> ??
		//[음수 표현법: 2의 보수법]
		//-10
		//1)절대치 |-10| 10
		//2)2진수		0000 1010
		//3)보수		1111 0101
		//4)+1			0000 0001
		//				1111 0110 // 앞에 1이있으면 음수
		
		// 어떤 음수값 2진수 : 1010 0001 
//								0101 1111
//								64+16+8+4+2+1
//								-95
		
		//정보처리기사 자격증
		//[실수 진법 변환]
		/* 
		 * 0.625 ( 10진수 실수 ) ->2진수 실수
		 * 0.625 x 2 = [1].25 
		 *  0.25 x 2 = [0].5
		 *  0.5  x 2 = [1].0
		 *  
		 *  0.[1][0][1]
		 *  
		 *  
		 *  0.101 (2)
		 *  
		 *  	1x2^-1 + 0x2^-2+1x2^-3 (10)
		 */
		
		
		
	}//main

}//class
